app/Controllers/Home.php

DELETE FROM "informacion"
WHERE "id" = '1'
---
    public function borrarinfromacion($id)
    {
        $db = \Config\Database::connect();
        $db->table('informacion')->where('id', $id)->delete();   // borrar la noticia segun el ID proporcionado

INSERT INTO "informacion" ("id", "tema", "argumento", "fecha", "fuente", "url") VALUES ('1', '03 DE NOVIEMBRE: DÍA INTERNACIONAL CONTRA LA VIOLENCIA Y EL ACOSO ESCOLAR DE NIÑAS, NIÑOS Y ADOLESCENTES', 'La violencia contra las niñas, niños y adolescentes asume formas y magnitudes cada vez más diversas e intensas. Entre estas nuevas formas se encuentran el acoso escolar y el ciberacoso, que afecta a millones de niños a nivel mundial, y que dejan profundas secuelas psicológicas que pueden perdurar para toda la vida....', '2022-11-07', 'Protección derechos', 'https://proteccionderechosquito.gob.ec/2022/11/07/15041173')
---
    public function agregarInformacion()
{
    $data = $this->request->getJSON(true); // insertar los datos enviados en la solicitud POST en formato JSON

    // comando para agregar o insertar los datos a la base de datos
    $db = \Config\Database::connect();
    $db->table('informacion')->set($data)->insert();